app/Controllers/Siswa/Dashboard.php

    public function index()
    {
        $pendaftaranModel = new PendaftaranModel();
        $pengaturanModel = new PengaturanModel();

        $data['pendaftaran'] = $pendaftaranModel->where('id_user', session()->get('id'))->first();
---
SELECT *
FROM `pendaftaran`
WHERE `id_user` = '2'
 LIMIT 1