app/Controllers/Siswa/Pendaftaran.php

    public function index()
    {
        $pendaftaranModel = new PendaftaranModel();
        $agamaModel = new AgamaModel();
        $pekerjaanModel = new PekerjaanModel();
        $persyaratanModel = new PersyaratanModel();
        $pengaturanModel = new PengaturanModel();

        $pengaturan = $pengaturanModel->first();
        if ($pengaturan && $pengaturan->is_open == 0) {
            return redirect()->to('/siswa/dashboard')->with('error', 'Masa pendaftaran sedang ditutup.');
        }

        $id_user = session()->get('id');
        $cekDaftar = $pendaftaranModel->where('id_user', $id_user)->first();

        if ($cekDaftar) {
            return redirect()->to('/siswa/dashboard');
        }

        $data['agama'] = $agamaModel->findAll();
        $data['pekerjaan'] = $pekerjaanModel->findAll();
        $data['persyaratan'] = $persyaratanModel->findAll();
---
SELECT *
FROM `pendaftaran`
WHERE `id_user` = '3'
 LIMIT 1
SELECT *
FROM `agama`
SELECT *
FROM `pekerjaan`
SELECT *
FROM `persyaratan`

    public function update_berkas()
    {
        $berkasModel = new BerkasPendaftaranModel();
        $pendaftaranModel = new PendaftaranModel();
        $id_pendaftaran = $this->request->getPost('id_pendaftaran');

        if ($this->request->getFiles()) {
            $files = $this->request->getFiles();
            if (isset($files['berkas'])) {
                foreach ($files['berkas'] as $idPersyaratan => $file) {
                    if ($file->isValid() && !$file->hasMoved()) {
                        $newName = $file->getRandomName();
                        $file->move('uploads/siswa/', $newName);

                        $exist = $berkasModel->where('id_pendaftaran', $id_pendaftaran)->where('id_persyaratan', $idPersyaratan)->first();
                        if ($exist) {
                            if (file_exists('uploads/siswa/' . $exist->file_path)) {
                                unlink('uploads/siswa/' . $exist->file_path);
                            }
                            $berkasModel->update($exist->id, ['file_path' => $newName]);
                        } else {
                            $berkasModel->insert([
                                'id_pendaftaran' => $id_pendaftaran,
                                'id_persyaratan' => $idPersyaratan,
                                'file_path'      => $newName
                            ]);
---
INSERT INTO `berkas_pendaftaran` (`id_pendaftaran`, `id_persyaratan`, `file_path`) VALUES (1, 1, '1773223392_71549023fc8761ddbbb2.png')