app/Controllers/Siswa/Pendaftaran.php

            'status_pendaftaran' => 'Menunggu'
        ];

        $pendaftaranModel->insert($dataInsert);
---
INSERT INTO `pendaftaran` (`id_user`, `no_kk`, `nik_siswa`, `nama_peserta_didik`, `nama_panggilan`, `jenis_kelamin`, `tempat_lahir`, `tanggal_lahir`, `id_agama`, `kewarganegaraan`, `anak_ke`, `jumlah_saudara_kandung`, `jumlah_saudara_angkat`, `bahasa_sehari_hari`, `berat_badan`, `tinggi_badan`, `alamat`, `no_telp`, `tempat_tinggal`, `nama_ayah`, `nama_ibu`, `nik_ayah`, `nik_ibu`, `pendidikan_ayah`, `pendidikan_ibu`, `penghasilan_ayah`, `penghasilan_ibu`, `id_pekerjaan_ayah`, `id_pekerjaan_ibu`, `nama_wali`, `pendidikan_wali`, `hubungan_wali`, `id_pekerjaan_wali`, `masuk_sebagai`, `asal_peserta_didik`, `nama_tk`, `tahun_nomor_ijazah`, `ttd_ortu`, `status_pendaftaran`, `created_at`, `updated_at`) VALUES ('2', '123456', '121837', 'Mus J', 'Mus', 'Laki-laki', 'Jakarta', '2026-03-10', '1', 'WNI', '2', '2', '0', 'Indonesia ', '1', '10', 'Jakarta Barat ', '0822888777222', 'Orang Tua', 'Ayah', 'Ibu', '128822726', '9281716', 'S3', 'S2', '> 2.000.000', '> 2.000.000', '1', '1', '', '', '', NULL, 'Murid Baru', 'Sekolah Herry Potter ', 'Kanak', '81817162625252', '69b13ddfa98bd.png', 'Menunggu', '2026-03-11 17:03:11', '2026-03-11 17:03:11')