app/Controllers/Siswa/Profil.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function index()
    {
        $userModel = new UserModel();
        $data['siswa'] = $userModel->find(session()->get('id'));

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `foto_profil` = '1773214998_ab01670a3e6cc715e50c.png', `updated_at` = '2026-03-11 14:43:18'
WHERE `users`.`id` IN ('2')
---
    public function update()
    {
        $userModel = new UserModel();
        $id = session()->get('id');
        $user = $userModel->find($id);

        $file = $this->request->getFile('foto_profil');
        $namaFoto = $user->foto_profil;

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $namaFoto = $file->getRandomName();
            $file->move('uploads/profil/', $namaFoto);
            if ($user->foto_profil != 'default.png' && file_exists('uploads/profil/' . $user->foto_profil)) {
                unlink('uploads/profil/' . $user->foto_profil);
            }
            session()->set('foto_profil', $namaFoto);
        }

        $updateData = [
            'foto_profil' => $namaFoto
        ];

        $password = $this->request->getPost('password');
        if (!empty($password)) {
            $updateData['password'] = password_hash($password, PASSWORD_DEFAULT);
        }

        $userModel->update($id, $updateData);