app/Controllers/Admin/Agama.php

SELECT *
FROM `agama`
---
    public function index()
    {
        $data['agama'] = $this->agamaModel->findAll();