app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $pendaftaranModel = new PendaftaranModel();

        $data = [
            'total_pendaftar' => $pendaftaranModel->countAllResults(),
            'menunggu' => $pendaftaranModel->where('status_pendaftaran', 'Menunggu')->countAllResults(),
            'diterima' => $pendaftaranModel->where('status_pendaftaran', 'Diterima')->countAllResults(),
            'ditolak' => $pendaftaranModel->where('status_pendaftaran', 'Ditolak')->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
WHERE `status_pendaftaran` = 'Menunggu'
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
WHERE `status_pendaftaran` = 'Diterima'
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
WHERE `status_pendaftaran` = 'Ditolak'