app/Controllers/Admin/Konfirmasi.php

    public function index()
    {
        $data['pendaftar'] = $this->pendaftaranModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `pendaftaran`
ORDER BY `created_at` DESC

    public function approve($id)
    {
        $this->pendaftaranModel->update($id, [
            'status_pendaftaran' => 'Diterima',
            'alasan_tolak' => null
        ]);
---
UPDATE `pendaftaran` SET `status_pendaftaran` = 'Diterima', `alasan_tolak` = NULL, `updated_at` = '2026-03-11 17:05:33'
WHERE `pendaftaran`.`id` IN ('1')