app/Controllers/Admin/Pekerjaan.php

    public function index()
    {
        $data['pekerjaan'] = $this->pekerjaanModel->findAll();
---
SELECT *
FROM `pekerjaan`

    public function store()
    {
        $this->pekerjaanModel->insert([
            'nama_pekerjaan' => $this->request->getPost('nama_pekerjaan')
        ]);
---
INSERT INTO `pekerjaan` (`nama_pekerjaan`) VALUES ('Petani')