app/Controllers/Admin/Persyaratan.php

    public function index()
    {
        $data['persyaratan'] = $this->persyaratanModel->findAll();
---
SELECT *
FROM `persyaratan`