app/Controllers/Admin/ProfilSekolah.php

SELECT *
FROM `profil_sekolah`
 LIMIT 1
---
    public function index()
    {
        $profilModel = new ProfilSekolahModel();
        $data['sekolah'] = $profilModel->first();