app/Controllers/Auth.php

    public function login()
    {
        $userModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'siswa2'
 LIMIT 1

    public function store_register()
    {
        $pengaturanModel = new PengaturanModel();
        $pengaturan = $pengaturanModel->first();

        if ($pengaturan && $pengaturan->is_open == 0) {
            return redirect()->to('/auth/register')->with('error', 'Maaf, pendaftaran akun saat ini sedang ditutup.');
        }

        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $cek_username = $userModel->where('username', $username)->first();

        if ($cek_username) {
            return redirect()->back()->with('error', 'Username sudah digunakan, silakan pilih username lain.');
        }

        $userModel->insert([
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'username'     => $username,
            'password'     => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'foto_profil'  => 'default.png',
            'level'        => 'siswa'
        ]);
---
SELECT *
FROM `users`
WHERE `username` = 'siswa2'
 LIMIT 1
INSERT INTO `users` (`nama_lengkap`, `username`, `password`, `foto_profil`, `level`, `created_at`, `updated_at`) VALUES ('Siswa 2', 'siswa2', '$2y$10$SNELMoFlxxGL90y7hhuXZ.0M8LQq5OwGIeo3zGsmytrvWKeFmW53i', 'default.png', 'siswa', '2026-03-14 23:04:50', '2026-03-14 23:04:50')